#include<stdio.h>
#include<math.h>
#include<stdlib.h>
#include<conio.h>


//13579



//看看
//---------------------定义函数分割线-------------------------//

int ss(int s)  //定义素数函数
{
	double gs = sqrt((double)s);//s的平方根
	int s1 = 2;//要用s依次除以s1
	int sss = 0;
	if (s > 1 && s < 4)
	{
		sss = 1;//1表示素数，0表示合数
	}
	
	while (s1<=gs&& s % s1 != 0)
	{
		   //如果不能整除，则s1加一，直到大于gs为止
			s1++;
	}
	if (s1 > gs)
	{
		sss = 1;  //如果大于gs,说明前面所有的s1都不能整除，则为素数
	}
	else
	{
		sss = 0; //如果能整除，则是合数
	}
	
	return sss;
}

//---------------------定义函数分割线-------------------------//
int main()
{
	int start = 0;//主菜单变量
	while (start == 0)
	{
		printf("======欢迎你使用张煜堂制作的第一个菜单！======\n");
		printf("|       虽然比较简陋，但是是第一个！         |\n");
		printf("|                                            |\n");
		printf("|                                            |\n");
		printf("|     选项                                   |\n");
		printf("|         1.找出素数                         |\n");
		printf("|         2.验证哥德巴赫猜想                 |\n");
		printf("|         3.找出孪生素数                     |\n");
		printf("|         4.验证20以内取值的梅森素数         |\n");
		printf("|         5.退出                             |\n");
		printf("请输入选项对应数字：\n");
		int a;
		scanf_s("%d", &a);
		//=============================选项分割线=====================================
		while (a == 1)
		{
			int c1, c2 = 4;
			printf("\n*****           找出素数                *****\n");
			printf("请输入一个2000以内的正整数\n");
			scanf_s("%d", &c1);
			if (c1 == 1)
			{
				printf("\t很遗憾！%d不是素数！\n", c1);
			}
			else if (c1 > 1999 || c1 < 1 )
			{
				printf("\t你输入的数据不符合要求。\n");
			}
			else
			{
				int c2 = ss(c1);
				if (c2 == 1)
				{
					printf("\t恭喜！%d是一个素数！\n", c1);
				}
				else if (c2 == 0)
				{
					printf("\t很遗憾！%d不是素数！\n", c1);
				}
			}
			printf("按键盘任意键返回主菜单\n");
			_getch();
			system("cls");
			a = 0;   //返回主菜单，不让选项1再次出现
		}//选项1结束
		//=============================选项分割线=====================================
		while (a == 2)
		{
			int c2, d2,e2,sd2,se2,f2;
			d2 = 1;
			f2 = 1;
			printf("\n*****       验证哥德巴赫猜想            *****\n");
			printf("PS:哥德巴赫猜想：任何一个大于2的偶数都可以表示为两个素数之和\n");
			printf("请输入一个2000以内的偶数\n");
			scanf_s("%d", &c2);
			
			 while(c2 % 2 == 0&&c2<2000&&c2>0&&f2==1)
			{
				 e2 = c2 - d2;
				 sd2 = ss(d2); //判断d2是不是素数
				 se2 = ss(e2); //判断e2是不是素数
				 if (sd2 == 1 && se2 == 1)
				 {
					 printf("\t%d=%d+%d,%d和%d均为素数\n", c2, d2, e2, d2, e2);
					 f2 = 0;
				 }
				 else
				 {
					 d2++;
				 }

			}
			 if ((c2 % 2 != 0 || c2 > 2000 || c2 < 1)) printf("\t你输入的数据不符合要求。\n");
			 printf("按键盘任意键返回主菜单\n");
			 _getch();
			 system("cls");
			 a = 0;   //返回主菜单，不让选项1再次出现
		}//选项2结束
		//=============================选项分割线=====================================
		while (a == 3)
		{
			printf("\n*****       找出孪生素数            *****\n");
			printf("\n接下来将会为你呈现2000以内所有的孪生素数组合            \n");
			int c3, d3;
			for (c3 = 2; c3 <= 2000; c3++)
			{
				d3 = c3 + 2;
				if (ss(c3) == 1 && ss(d3) == 1)
				{
					printf("(%d,%d)  ", c3, d3);
				}
			}
			printf("\n按键盘任意键返回主菜单\n");
			_getch();
			system("cls");
			a = 0;   //返回主菜单
		}//选项3结束
		//=============================选项分割线=====================================
		while (a == 4)
		{
			int p;
			printf("\n*****     验证20以内取值的梅森素数      *****\n");
			printf("请输入一个20以内的正整数\n");
			scanf_s("%d", &p);
			if (ss(p) == 1)
			{
				double c4 = pow(2, (double)p) - 1;
				if (ss(c4) == 1)
				{
					printf("%d和%d都是素数，它们是一组梅森素数。",p,(int)c4);
				}
				else
				{
					printf("%d是素数，但它的梅森数%d不是素数。", p, (int)c4);
				}
			}
			else printf("\t%d不是素数！\n", p);
			printf("\n按键盘任意键返回主菜单\n");
			_getch();
			system("cls");
			a = 0;   //返回主菜单
		}//选项4结束
		while (a == 5)
		{
			return 0;
		}//选项5结束
	}//菜单结束

}//主函数结束


